#+TITLE: propositum | =WINDOWS=
#+PROPERTY: header-args :tangle yes
#+OPTIONS: prop:t
[[https://img.shields.io/github/tag/xeijin/propositum.svg?label=release&style=flat-square]] [[https://ci.appveyor.com/project/xeijin/propositum][https://img.shields.io/appveyor/ci/xeijin/propositum.svg?style=flat-square&logo=appveyor&label=build]] [[https://img.shields.io/badge/license-GPLv3-red.svg?style=flat-square]]

#+BEGIN_QUOTE
A collection of free and open-source, portable tools to facilitate task & information management, automation, data manipulation and analytics.
#+END_QUOTE

*** Export Tagged subtrees to ORG (for README)

Used to create a succinct README.org file for =GitLab= and others.

#+NAME: export-tagged-subtrees-org
#+BEGIN_SRC elisp :var tagname="README" outputdir="../"
(let ((org-export-select-tags (list tagname)) (async nil) (subtreep nil) (visible-only nil) (body-only nil) (ext-plist '())) 
               (org-export-to-file 'org (concat outputdir tagname ".org") async subtreep visible-only body-only ext-plist))
#+END_SRC

#+RESULTS: export-tagged-subtrees-org
: ../README.org
